In [20]:
%matplotlib inline
import pandas as pd
import numpy as np

In [21]:
from IPython.core.display import HTML
css = open('style-table.css').read() + open('style-notebook.css').read()
HTML('<style>{}</style>'.format(css))

In [22]:
titles = pd.read_csv(r'D:\Downloads\pycon-pandas-tutorial-master\data\titles.csv')
titles.head()

                 title  year
0   A Trip to the Moon  2017
1  My Wife's Relatives  1939
2     Passione d'amore  1981
3           Purple Day  1999
4       Sud Side Stori  2000

In [23]:
cast = pd.read_csv(r'D:\Downloads\pycon-pandas-tutorial-master\data\cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Define a year as a "Superman year" whose films feature more Superman characters than Batman. How many years in film history have been Superman years?

In [30]:
superman_count = cast.loc[cast['character'] == 'Superman'].groupby('year')['character'].count().reset_index(name='superman_count')
batman_count = cast.loc[cast['character'] == 'Batman'].groupby('year')['character'].count().reset_index(name='batman_count')
sup_bat_merged = superman_count.merge(batman_count, on='year')
sup_bat_merged['remarks'] = np.where(
    sup_bat_merged['superman_count'] > sup_bat_merged['batman_count'],
    'Superman Year',
    np.where(
        sup_bat_merged['superman_count'] < sup_bat_merged['batman_count'], 
        'Batman Year',
        'Same')
)
print(sup_bat_merged.loc[sup_bat_merged['remarks'] == 'Superman Year'])

   year  superman_count  batman_count        remarks
0  1973               2             1  Superman Year

In [38]:
sup_bat_merged2 = superman_count.merge(batman_count, on='year')
sup_bat_merged2['remark'] = sup_bat_merged2.apply(
    lambda x: 'Superman Year' 
    if x['superman_count'] > x['batman_count'] 
    else ('Batman Year' 
          if  x['superman_count'] < x['batman_count'] 
          else 'Same'), 
    axis=1
)
print(sup_bat_merged2.loc[sup_bat_merged2['remark'] == 'Superman Year'])

   year  superman_count  batman_count         remark
0  1973               2             1  Superman Year

### How many years have been "Batman years", with more Batman characters than Superman characters?

In [39]:
print(sup_bat_merged2.loc[sup_bat_merged2['remark'] == 'Batman Year'])

    year  superman_count  batman_count       remark
11  2009               1             3  Batman Year
12  2010               1             3  Batman Year
13  2011               2             4  Batman Year
14  2013               1             5  Batman Year
15  2014               1             5  Batman Year
16  2015               1             4  Batman Year
17  2016               4            12  Batman Year
18  2017               5             9  Batman Year
19  2018               2             4  Batman Year

### Plot the number of actor roles each year and the number of actress roles each year over the history of film.

### Plot the number of actor roles each year and the number of actress roles each year, but this time as a kind='area' plot.

### Plot the difference between the number of actor roles each year and the number of actress roles each year over the history of film.

### Plot the fraction of roles that have been 'actor' roles each year in the history of film.

### Plot the fraction of supporting (n=2) roles that have been 'actor' roles each year in the history of film.

### Build a plot with a line for each rank n=1 through n=3, where the line shows what fraction of that rank's roles were 'actor' roles for each year in the history of film.